[
  {
    "year": 2024,
    "type": "journal",
    "title": "Krishna Kant Dubey, Shivani Rastogi, Ajit K. Jena, Gaurav K. Shukla, Parul Devi, Seung-Cheol Lee, Satadeep Bhattacharjee, R. Rawat, Boby Joseph, and Sanjay Singh*, Pressure driven iso-structural phase transition and its implication on the Néel skyrmion host hexagonal PtMnGa, Phys. Rev. Materials 8, 125404 (2024)"
  },
  {
    "year": 2025,
    "type": "journal",
    "title": "Shivani Rastogi, Vishal Kumar, Ajit K. Jena, Nisha Shahi, Gaurav K. Shukla, Sunil Wilfred D’Souza, Satadeep Bhattacharjee, Sanjay Singh*, Atomic disorder and intrinsic anomalous Hall effect in a half-metallic ferromagnet Co2VAl, J. Alloys Compd., 1010, 177212 (2025)"
  },
  {
    "year": 2024,
    "type": "journal",
    "title": "Nisha Shahi, Gaurav K. Shukla, Vishal Kumar, and Sanjay Singh*, Spin reorientation and sign reversal of Berry curvature induced intrinsic anomalous Hall effect in the manganese pnictide MnSb, Phys. Rev. B 109, 245136 (2024)."
  },
  {
    "year": 2024,
    "type": "journal",
    "title": "Ujjawal Modanwal, Gaurav K. Shukla, Ajit K. Jena, Satadeep Bhattacharjee, Sunil Wilfred D’Souza, Jan Minár, and Sanjay Singh*, Tuning of nodal line states via chemical alloying in Co2CrX (X = Ga, Ge) Heusler compounds for a large anomalous Hall effect, Phys. Rev. Mater. 8, 034203 (2024)."
  },
  {
    "year": 2024,
    "type": "journal",
    "title": "A. Tripathy, K. Dey, S. R. Sahu, Najnin Bano, Vishal Kumar, P. Garg, Sanjay Singh, Vishnu Kumar, Local structural disorder and charge inhomogeneity induced relaxor ferroelectricity in CuCrO2, Phys. Rev. B 109, 134206 (2024)."
  },
  {
    "year": 2024,
    "type": "journal",
    "title": "Shamim Sk, P Devi, Sanjay Singh, Sudhir K Pandey, Thermoelectric properties of Fe2VAl in the temperature range 300–800 K: A combined experimental and theoretical study, J. Phys. B: Condens. Matter 673, 415496 (2024)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Shivani Rastogi, Nisha Shahi, Vishal Kumar, Gaurav K. Shukla, Satadeep Bhattacharjee, and Sanjay Singh*, Revealing the origin of the topological Hall effect in the centrosymmetric shape memory Heusler alloy Mn2NiGa: A combined experimental and theoretical investigation, Phys. Rev. B 108, 224108 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Srishti Dixit, Swayangsiddha Ghosh, Neha Patel, Mohd Alam, Krishanu Bandyopadhyay, Nisha Shahi, Yogendra Kumar, M Sawada, Kenya Shimada, Satyen Saha, Sanjay Singh, Sandip Chatterjee, Raman effect and unusual transport properties of Co-doped Mn2FeAl Heusler alloy, Europhys. Lett. 144, 56003 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "E Ketkar, Gaurav K Shukla, Seung-Cheol Lee, Satadeep Bhattacharjee, Sanjay Singh*, Enhanced spin Hall conductivity and charge to spin conversion efficiency in strained orthorhombic SnSe through orbital selective hybridization, Appl. Phys. Lett. 123, 182403 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Nisha Shahi, Shivani Rastogi, Sanjay Singh*, Possible Topological Hall Effect in a Spin GaplessSemiconducting Mn2CoAl Heusler Compound, Phys. Status Solidi RRL, 2300352 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Vishal Kumar, Gaurav K. Shukla, Nisha Shahi, Sanjay Singh*, Topological Hall Effect in (Mn1−xFex)3.25Ge (x = 0.4) Hexagonal Magnet, Phys. Status Solidi RRL 17, 2300174 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Anupam K Singh, Parul Devi, Nisha Shahi, KK Dubey, Sanjay Singh*, Dhananjai Pandey, Nature of magnetic transitions and evidence for magnetoelastic coupling in the biskyrmion-host hexagonal compound MnNiGa, J. Alloys and Comp 954, 170082 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Gaurav K. Shukla, Ujjawal Modanwal, Sanjay Singh*, Nodal-line symmetry breaking induced colossal anomalous Hall and Nernst effect in Cu2CoSn Heusler compound, Appl. Phys. Lett. 123, 052402 (2023)."
  },
  {
    "year": 2023,
    "type": "journal",
    "title": "Shrishti Dixit, Labanya Ghosh, Mohd Alam, Satya Vijaya Kumar, Neha Patel, Swayangsiddha Ghosh, Nisha Shahi, Sanjay Singh, Sandip Chatterjee*, Existence of exotic magnetic phases along with exchange bias and memory effect in frustrated beta-Mn Heusler alloy, J. Appl. Phys. 133, 013904 (2023)."
  },
  {
    "year": 2022,
    "type": "journal",
    "title": "Anupam K. Singh, Gaurav K. Shukla, and Sanjay Singh*, Intrinsic anomalous Hall conductivity and real space Berry curvature induced topological Hall Effect in Ni2MnGa Magnetic Shape Memory Alloy, J. Phys. D: Appl. Phys. (2022)."
  },
  {
    "year": 2022,
    "type": "journal",
    "title": "Nisha Shahi, Ajit K. Jena, Gaurav K. Shukla, Vishal Kumar, Shivani Rastogi, K. K. Dubey, Indu Rajput, Sonali Baral, Archana Lakhani, Seung-Cheol Lee, Satadeep Bhattacharjee, and Sanjay Singh*, Anti-site disorder and Berry curvature driven anomalous Hall effect in spin gapless semiconducting Mn2CoAl Heusler compound, Phys. Rev. B 106, 245137 (2022)."
  },
  {
    "year": 2022,
    "type": "journal",
    "title": "Gaurav K. Shukla, Jyotirmoy Sau, Vishal Kumar, Manoranjan Kumar, and Sanjay Singh*, Band splitting induced Berry flux and intrinsic anomalous Hall conductivity in NiCoMnGa quaternary Heusler compound, Phys. Rev. B 106, 045131 (2022)."
  },
  {
    "year": 2022,
    "type": "journal",
    "title": "Gaurav K. Shukla, Jyotirmoy Sau, Vishal Kumar, Manoranjan Kumar, and Sanjay Singh*, Band splitting induced Berry flux and intrinsic anomalous cductivity in the NiCoMnGa quaternary Heusler compound, Phys. Rev. B 106, 045131 (2022)."
  },
  {
    "year": 2022,
    "type": "journal",
    "title": "Anupam K Singh, Parul Devi, Ajit K Jena, Ujjawal Modanwal, Seung-Cheol Lee, Satadeep Bhattacharjee, Boby Joseph, Sanjay Singh*, Pressure induced isostructural phase transition in biskyrmion host hexagonal MnNiGa, Phys. Status Solidi RRL, 2200057 (2022)."
  },
  {
    "year": 2022,
    "type": "journal",
    "title": "Gaurav K. Shukla, Ajit K. Jena, Nisha Shahi, K. K. Dubey, Indu Rajput, Sonali Baral, Kavita Yadav, K. Mukherjee, Archana Lakhani, Karel Carva, Seung-Cheol Lee, Satadeep Bhattacharjee, Sanjay Singh*, Atomic disorder and Berry phase driven anomalous Hall effect in Co2FeAl Heusler compound, Phys. Rev. B 105, 035124 (2022)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Ricardo D. dos Reis, Luana Caron, Sanjay Singh, Claudia Felser and Michael Nicklas, Direct and Indirect Determination of the Magnetocaloric Effect in the Heusler Compound Ni1.7Pt0.3MnGa, Entropy 23, 1273 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Anupam K. Singh, Sanjay Singh*, B. Dutta, K. K. Dubey, Boby Joseph, R. Rawat, Dhananjai Pandey, Robust evidence for the stabilization of the premartensite phase in Ni-Mn-In magnetic shape memory alloys by chemical pressure, Phys. Rev. Materials 5, 113607 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "P. Chaudhary, K. K. Dubey, G. K. Shukla, S. Sadhu Khan, S. Kanungo, A. K. Jena, S.-C. Lee, S. Bhattacharjee, J. Minar, and S. W. D’Souza and Sanjay Singh*, Role of chemical disorder in tuning the Weyl points in Vanadium doped Co2TiSn, Phys. Rev. Materials 5, 124201 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Gaurav K. Shukla, Jyotirmoy Sau, Nisha Shahi, Anupam K. Singh, Manoranjan Kumar, and Sanjay Singh*, Anomalous Hall effect from gapped nodal line in the Co2FeGe Heusler compound, Phys. Rev. B 104, 195108 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Anupam K. Singh, Sanjay Singh* and D. Pandey, Pair distribution function study of Ni2MnGa magnetic shape memory alloy: Evidence for the precursor state of the premartensite phase, Phys. Rev. B, 104, 064110 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Y.S. Chen, J.G. Lin, Sanjay Singh, K. Manna, G.H. Fecher, C. Felser, Martensite-austenite transition correlated twinning and symmetry breaking in single crystalline Ni50Mn35In15, Phys. Rev. Mater. 5, 034418 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Keshav Kumar, Shrawan K. Mishra, Sanjay Singh, Ivan Baev, Michael Martins, Fabio Orlandi, Pascal Manuel and Dhananjai Pandey, Evidence for Conical Magnetic Structure in M-type BaFe12O19 Hexaferrite: A Combined Single-Crystal XMCD and Neutron Diffraction Study, Phys. Status Solidi RRL 15, 2000506 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Avirup De, Anupam K. Singh, Sanjay Singh, and Sunil Nair, Temperature dependence of the anomalous Nernst effect in Ni2MnGa shape memory alloy, Phys. Rev. B 103, L020404 (2021)."
  },
  {
    "year": 2021,
    "type": "journal",
    "title": "Govindaraj Lingannan, Anupam K. Singh, Boby Joseph, Sanjay Singh and Sonachalam Arumugam, High-Pressure Structural Investigation of Anomalous Hall Effect Compound Mn3Sn up to 9 GPa, Phys. Status Solidi RRL 2000605 (2021)."
  },
  {
    "year": 2020,
    "type": "journal",
    "title": "P Sivaprakash, S Esakki Muthu, Anupam K Singh, KK Dubey, M Kannan, S Muthukumaran, Shampa Guha, Manoranjan Kar, Sanjay Singh, S Arumugam, Effect of chemical and external hydrostatic pressure on magnetic and magnetocaloric properties of Pt doped Ni2MnGa shape memory Heusler alloys, J. Mag. Mag. Mater. 514, 167136 (2020)."
  },
{
  "year": 2020,
  "type": "journal",
  "title": "R. D. dos Reis, M. Ghorbani Zavareh, M. O. Ajeesh, L. O. Kutelak, A. S. Sukhanov, Sanjay Singh, J. Noky, Y. Sun, J. E. Fischer, K. Manna, C. Felser, and M. Nicklas, Pressure tuning of the anomalous Hall effect in the chiral antiferromagnet Mn3Ge, Phys. Rev. Materials 4, 051401(R) (2020)."
},
{
  "year": 2020,
  "type": "journal",
  "title": "K.K. Dubey, P. Devi, Anupam K. Singh, Sanjay Singh, Improved crystallographic compatibility and magnetocaloric reversibility in Pt substituted Ni2Mn1.4In0.6 magnetic shape memory Heusler alloy, J. Mag. Mag. Mater. 507, 166818 (2020)."
},
{
  "year": 2019,
  "type": "journal",
  "title": "P. Devi, C. Salazar Mejía, L. Caron, Sanjay Singh, M. Nicklas, and C. Felser, Effect of chemical and hydrostatic pressure on the coupled magnetostructural transition of Ni-Mn-In Heusler alloys, Phys. Rev. Materials 3, 122401(R) (2019)."
},
{
  "year": 2019,
  "type": "journal",
  "title": "P. Devi, C. Salazar Mejía, M. Ghorbani Zavareh, K. K. Dubey, Pallavi Kushwaha, Y. Skourski, C. Felser, M. Nicklas, and Sanjay Singh*, Improved magnetostructural and magnetocaloric reversibility in magnetic Ni-Mn-In shape-memory Heusler alloy by optimizing the geometric compatibility condition, Phys. Rev. Materials 3, 062401(R) (2019)."
},
{
  "year": 2019,
  "type": "journal",
  "title": "Kavita Yadav, Mohit K. Sharma, Sanjay Singh, and K. Mukherjee, Exotic magnetic behaviour and evidence of cluster glass and Griffiths like phase in Heusler alloys Fe2-xMnxCrAl (0≤x≤ 1), Scientific Reports 9, 15888 (2019)."
},
{
  "year": 2019,
  "type": "journal",
  "title": "Shamim S. K., P. Devi, Sanjay Singh and S. K. Pandey, Exploring the best scenario for understanding the high temperature thermoelectric behaviour of Fe2VAl, Mater. Res. Express 6, 026302 (2019)."
},
{
  "year": 2018,
  "type": "journal",
  "title": "P. Devi, M. Ghorbani Zavareh, C. Salazar Mejía, K. Hofmann, B. Albert, C. Felser, M. Nicklas, and Sanjay Singh*, Reversible adiabatic temperature change in the shape memory Heusler alloy Ni2.2Mn0.8Ga: An effect of structural compatibility, Phys. Rev. Materials 2, 122401(R) (2018)."
},
{
  "year": 2018,
  "type": "journal",
  "title": "P. Devi, Sanjay Singh, B. Dutta, K. Manna, S.W. D'Souza, Y. Ikeda, E. Suard, V. Petricek, P. Simon, P. Werner, S. Chadhov, Stuart S.P. Parkin, C. Felser, D. Pandey, Adaptive modulation in the Ni2Mn1.4In0.6 magnetic shape-memory Heusler alloy, Phys. Rev. B 97, 224102 (2018)."
},
{
  "year": 2018,
  "type": "journal",
  "title": "C. Shekhar, N. Kumara, V. Grinenko, Sanjay Singh, R. Sarkar, H. Luetkens, Shu-Chun Wu, Yang Zhang, Alexander C. Komarek, Erik Kampert, Yurii Skourski, Jochen Wosnitza, Walter Schnelle, Alix McCollam, Uli Zeitler, Jürgen Kübler, Binghai Yan, H.-H. Klauss, S. S. P. Parkin, and C. Felser, Anomalous Hall effect in Weyl semimetal half-Heusler compounds RPtBi (R = Gd and Nd), Proceedings of the National Academy of Sciences 115 (37) 9140–9144 (2018). https://doi.org/10.1073/pnas.1810842115"
},
{
  "year": 2018,
  "type": "journal",
  "title": "A. S. Sukhanov, Sanjay Singh, L. Caron, Th. Hansen, A. Hoser, V. Kumar, H. Borrmann, A. Fitch, P. Devi, K. Manna, C. Felser, D.S. Inosov, Gradual pressure-induced change in the magnetic structure of the noncollinear antiferromagnet Mn3Ge, Phys. Rev. B 97, 214402 (2018)."
},
{
  "year": 2017,
  "type": "journal",
  "title": "Sanjay Singh, B. Dutta, S. W. D’Souza, M. G. Zavareh, P. Devi, A. S. Gibbs, T. Hickel, S. Chadov, C. Felser and D. Pandey, Nature Commun. 8, 1006 (2017)."
},
{
  "year": 2017,
  "type": "journal",
  "title": "Jayita Nayak, Shu-Chun Wu, Nitesh Kumar, Chandra Shekhar, Sanjay Singh, Jorg Fink, Emile E.D. Rienks, Gerhard H. Fecher, Stuart S.P. Parkin, Binghai Yan & Claudia Felser, Nature Commun. 8, 13942 (2017)."
},
{
  "year": 2017,
  "type": "journal",
  "title": "C. Nethravathi, C. Rajamathi, S. Singh, M. Rajamathi, C. Felser, RSC Advances 7, 1413–1417 (2017)."
},
{
  "year": 2017,
  "type": "journal",
  "title": "L. Caron, B. Dutta, P. Devi, M. Ghorbani Zavareh, T. Hickel, R. Cabassi, F. Bolzoni, S. Fabbrici, F. Albertini, C. Felser, and Sanjay Singh, Phys. Rev. B 96, 054105 (2017)."
},
{
  "year": 2017,
  "type": "journal",
  "title": "S. Arumugam, U. Devarajan, S. Esakki Muthu, Sanjay Singh, R. Thiyagarajan, M. Manivel Raja, N.V. Rama Rao, Alok Banerjee, Journal of Magnetism and Magnetic Materials 442, 460 (2017)."
},
{
  "year": 2016,
  "type": "journal",
  "title": "Sanjay Singh, S. W. D’Souza, J. Nayak, E. Suard, L. Chapon, A. Senyshyn, V. Petricek, Y. Skourski, M. Nicklas, C. Felser & S. Chadov, Nature Commun. 7, 12671 (2016)."
},
{
  "year": 2016,
  "type": "journal",
  "title": "Sanjay Singh, Luana Caron, Sunil Wilfred D'Souza, Tina Fichtner, Giacomo Porcari, Simone Fabbrici, Chandra Shekhar, Stanislav Chadov, Massimo Solzi, and Claudia Felser, Advanced Materials 28, 3321 (2016)."
},
{
  "year": 2012,
  "type": "journal",
  "title": "Sanjay Singh, R. Rawat, S. E. Muthu, S. W. D’Souza, E. Suard, A. Senyshyn, S. Banik, P. Rajput, S. Bharadwaj, A. M. Awasthi, R. Ranjan, S. Arumugam, D. Schlagel, T. Lograsso, Aparna Chakrabarti, and S. R. Barman, Phys. Rev. Lett. 109, 246601 (2012)."
},
{
  "year": 2012,
  "type": "journal",
  "title": "J. Nayak, M. Maniraj, Abhishek Rai, Sanjay Singh, Parasmani Rajput, A. Gloskovskii, J. Zegenhagen, D. L. Schlagel, T. A. Lograsso, K. Horn, and S. R. Barman, Phys. Rev. Lett. 109, 216403 (2012)."
},
{
  "year": 2017,
  "type": "journal",
  "title": "L. Caron, B. Dutta, P. Devi, M. Ghorbani Zavareh, T. Hickel, R. Cabassi, F. Bolzoni, S. Fabbrici, F. Albertini, C. Felser, and Sanjay Singh, Phys. Rev. B 96, 054105 (2017)."
},
{
  "year": 2016,
  "type": "journal",
  "title": "Sanjay Singh, S. W. D’Souza, J. Nayak, L. Caron, E. Suard, S. Chadov, and C. Felser, Phys. Rev. B 93, 134102 (2016)."
},
{
  "year": 2015,
  "type": "journal",
  "title": "Sanjay Singh, J. Bednarcik, S. R. Barman, C. Felser, and D. Pandey, Phys. Rev. B, 92, 054112 (2015)."
},
{
  "year": 2015,
  "type": "journal",
  "title": "Sanjay Singh, Pallavi Kushwaha, F. Scheibel, Hanns-Peter Liermann, S. R. Barman, M. Acet, C. Felser, and D. Pandey, Phys. Rev. B 92, 020105 (R) (2015)."
},
{
  "year": 2014,
  "type": "journal",
  "title": "Sanjay Singh, V. Petricek, P. Rajput, A. H. Hill, E. Suard, S. R. Barman, and Dhananjai Pandey, Phys. Rev. B 90, 014109 (2014)."
},
{
  "year": 2012,
  "type": "journal",
  "title": "R. Bindu, Sanjay Singh, Navneet Singh, R. Ranjan, Kalobaran Maiti, A. H. Hill, and S. R. Barman, Phys. Rev. B 86, 140104 (R) (2012)."
},
{
  "year": 2008,
  "type": "journal",
  "title": "S. R. Barman, Aparna Chakrabarti, Sanjay Singh, S. Banik, S. Bhardwaj, P. L. Paulose, B. A. Chalke, A. K. Panda, A. Mitra, and A. M. Awasthi, Phys. Rev. B 78, 134406 (2008)."
},
{
  "year": 2009,
  "type": "journal",
  "title": "A. K. Shukla, R. S. Dhaka, S. W. D’Souza, Sanjay Singh, K. Horn, D. Wu, T. A. Lograsso, M. Krajčí, J. Hafner, and S. R. Barman, Phys. Rev. B 79, 134206 (2009)."
},
{
  "year": 2008,
  "type": "journal",
  "title": "S. Banik, R. Rawat, P. K. Mukhopadhyay, B. L. Ahuja, A. Chakrabarti, P. L. Paulose, Sanjay Singh, A.K. Singh, D. Pandey, and S. R. Barman, Phys. Rev. B 77, 224417 (2008)."
},
{
  "year": 2014,
  "type": "journal",
  "title": "Sanjay Singh, S. W. D'Souza, K. Mukherjee, P. Kushwaha, S. R. Barman, Sandeep Agarwal, P. K. Mukhopadhyay, Aparna Chakrabarti, and E. V. Sampathkumaran, Appl. Phys. Lett. 104, 231909 (2014)."
},
{
  "year": 2014,
  "type": "journal",
  "title": "Sanjay Singh, S. Esakki Muthu, A. Senyshyn, P. Rajput, E. Suard, S. Arumugam, and S. R. Barman, Appl. Phys. Lett. 104, 051905 (2014)."
},
{
  "year": 2015,
  "type": "journal",
  "title": "D. K. Misra, A. Rajput, A. Bhardwaj, N. S. Chauhan, Sanjay Singh, Appl. Phys. Lett. 106 (10), 103901 (2015)."
},
{
  "year": 2014,
  "type": "journal",
  "title": "U. Devarajan, Sanjay Singh, S. Esakki Muthu, G. Kalai Selvan, P. Sivaprakash, S. Roy Barman, and S. Arumugam, Appl. Phys. Lett. 105, 252401 (2014)."
},
{
  "year": 2013,
  "type": "journal",
  "title": "U. Devarajan, S. Esakki Muthu, S. Arumugam, Sanjay Singh, and S. R. Barman, J. Appl. Phys. 114, 053906 (2013)."
},
{
  "year": 2013,
  "type": "journal",
  "title": "Sanjay Singh, J Nayak, Abhishek Rai, Parasmani Rajput, Adrian H Hill, S R Barman and Dhananjai Pandey, J. Phys. Condens. Matter. (FTC, IOP select) 25, 212203 (2013)."
},
{
  "year": 2012,
  "type": "journal",
  "title": "Sanjay Singh, K. R. A. Ziebeck, E. Suard, P. Rajput, S. Bharadwaj, A. M. Awasthi, and S. R. Barman, Appl. Phys. Lett. 101, 171904 (2012)."
},
{
  "year": 2011,
  "type": "journal",
  "title": "Sanjay Singh, Rajeev Rawat and S. R. Barman, Appl. Phys. Lett. 99, 021902 (2011)."
},
{
  "year": 2011,
  "type": "journal",
  "title": "M. Siewert, M. E. Gruner, A. Dannenberg, A. Chakrabarti, H. C. Herper, M. Wuttig, S. R. Barman, Sanjay Singh, A. Al-Zubi, T. Hickel, J. Neugebauer, M. Gillessen, R. Dronskowski, and P. Entel, Appl. Phys. Lett. 99, 191904 (2011)."
},
{
  "year": 2010,
  "type": "journal",
  "title": "Sanjay Singh, M. Maniraj, S. W. D’Souza, R. Ranjan, and S. R. Barman, Appl. Phys. Lett. 96, 081904 (2010)."
},
{
  "year": 2010,
  "type": "journal",
  "title": "B. L. Ahuja, Alpa Dashora, N. L. Heda, K. R. Priolkar, L. Vadkhiya, M. Itou, Nelson Lobo, Y. Sakurai, Aparna Chakrabarti, Sanjay Singh and S. R. Barman, J. Phys. Condens. Matter. 22, 446001 (2010)."
},
{
  "year": 2009,
  "type": "journal",
  "title": "S. Banik, Sanjay Singh, R. Rawat, P. K. Mukhopadhyay, B. L. Ahuja, A. M. Awasthi, S. R. Barman, and E. V. Sampathkumaran, J. Appl. Phys. 106, 103919 (2009)."
},
  {
    "title": "R. Ranjan, Sanjay Singh, H. Boysen, D. Trots, S. Banik, A. M. Awasthi, P. K. Mukhopadhyay, and S. R. Barman, J. Appl. Phys. 106, 033510 (2009).",
    "year": 2009,
    "type": "journal"
  },
  {
    "title": "S. Arumugam, U. Devarajan, S. Esakki Muthu, Sanjay Singh, R. Thiyagarajan, M. Manivel Raja, N.V. Rama Rao, Alok Banerjee, Jour. Alloys and Comp. 442, 460 (2017).",
    "year": 2017,
    "type": "journal"
  },
  {
    "title": "S. Esakki Muthu, M. Kanagaraj, Sanjay Singh, P.U. Sastry, G. Ravikumar, N.V. Rama Rao, M. Manivel Raja, S. Arumugam, Jour. Alloys and Comp.584, 175 (2014).",
    "year": 2014,
    "type": "journal"
  },
  {
    "title": "S Esakki Muthu, Sanjay Singh, R Thiyagarajan, G Kalai Selvan, N V Rama Rao, M Manivel Raja and S Arumugam, J. Phys. D: Appl. Phys. 46, 205001 (2013).",
    "year": 2013,
    "type": "journal"
  },
  {
    "title": "M. Maniraj, S. W. D’Souza, J. Nayak, Abhishek Rai, Sanjay Singh, B. N. Raja Sekhar, and S. R. Barman, Rev. Sci. Instrum. 82, 093901 (2011).",
    "year": 2011,
    "type": "journal"
  },
  {
    "title": "D. K. Misra, A. Bhardwaj and Sanjay Singh, J. Mater. Chem. A, 2, 11913 (2014).",
    "year": 2014,
    "type": "journal"
  },
  {
    "title": "PallabBag, Sanjay Singh, P.D.Babu, V. Siruguri, RajeevRawat, Physica B 448 50–52 (2014).",
    "year": 2014,
    "type": "journal"
  },
  {
    "title": "Sanjay Singh, S. Bhardwaj, A. K. Panda, V. K. Ahire, A. Mitra, A. M. Awasthi, and S.R. Barman, Materials Science Forum, 635, 43 (2010).",
    "year": 2010,
    "type": "journal"
  },
  {
    "title": "S. W. D’Souza, R.S. Dhaka, A. Rai, M. Maniraj, J. Nayak, Sanjay Singh, D.L. Schlagel, T.A. Lograsso, A. Chakrabarti and S. R. Barman, Materials Science Forum 684, 215 (2011).",
    "year": 2011,
    "type": "journal"
  },
  {
    "title": "Sanjay Singh, S. R. Barman and Dhananjai Pandey, Z. Kristallogr. 230 (1), 13-22 (2015).",
    "year": 2015,
    "type": "journal"
  },
  {
    "title": "Sanjay Singh, Rajeev Rawat and S. R. Barman, AIP Conf. Proc. 1349, 1017 (2011).",
    "year": 2011,
    "type": "conference"
  },
  {
    "title": "Sanjay Singh, S. Banik, S.Bhardwaj, P. L. Paulose, B. A. Chalke, A. K. Panda, A. Mitra, A. M. Awasthi, and S. R. Barman, Proceedings of the DAE Solid State Physics Symposium 53, 1267 (2008).",
    "year": 2008,
    "type": "conference"
  },
  {
    "title": "A. K. Shukla, R. S. Dhaka, S. W. D’Souza, Sanjay Singh, D. Wu, T. A. Lograsso, and S. R. Barman, Proceedings of the DAE Solid State Physics Symposium 53, 767 (2008).",
    "year": 2008,
    "type": "conference"
  }
]
